modules/ome-ocaml.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Oh My Emacs CC</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Oh My Emacs CC"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-12-30T17:03+0800"/>
<meta name="author" content=""/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Oh My Emacs CC</h1>

<p>This is part of the <a href="https://github.com/xiaohanyu/oh-my-emacs">oh-my-emacs</a>.
</p>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#ocaml-prerequisites">Prerequisites</a></li>
<li><a href="#ocaml-el-get-packages">El-get packages</a></li>
<li><a href="#sec-3">Things you should know about OCaml</a></li>
<li><a href="#ocaml-mode">OCaml-mode</a></li>
<li><a href="#tuareg">Tuareg-mode</a></li>
<li><a href="#sec-6">Todos</a></li>
</ul>
</div>
</div>

<div id="outline-container-ocaml-prerequisites" class="outline-2">
<h2 id="ocaml-prerequisites"><a name="sec-1" id="sec-1"></a>Prerequisites</h2>
<div class="outline-text-2" id="text-ocaml-prerequisites">


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption>Prerequisites for ome-ocaml module</caption>
<colgroup><col class="left" /><col class="left" /><col class="left" /><col class="left" /><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left"></th><th scope="col" class="left">Windows</th><th scope="col" class="left">Ubuntu/Debian/Mint</th><th scope="col" class="left">ArchLinux</th><th scope="col" class="left">Fedora</th><th scope="col" class="left">Mac OS X</th><th scope="col" class="left">Mandatory?</th></tr>
</thead>
<tbody>
<tr><td class="left"><a href="http://ocaml.org/">ocaml</a></td><td class="left"></td><td class="left">ocaml</td><td class="left"></td><td class="left"></td><td class="left"></td><td class="left">Yes</td></tr>
</tbody>
</table>


</div>

</div>

<div id="outline-container-ocaml-el-get-packages" class="outline-2">
<h2 id="ocaml-el-get-packages"><a name="sec-2" id="sec-2"></a>El-get packages</h2>
<div class="outline-text-2" id="text-ocaml-el-get-packages">


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption>El-get packages for ome-ocaml module</caption>
<colgroup><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left"></th><th scope="col" class="left">Status</th><th scope="col" class="left">Description</th></tr>
</thead>
<tbody>
<tr><td class="left"><a href="http://caml.inria.fr/svn/ocaml/trunk/emacs">caml-mode</a></td><td class="left">Required</td><td class="left">OCaml code editing commands for Emacs</td></tr>
<tr><td class="left"><a href="http://tuareg.forge.ocamlcore.org/">tuareg-mode</a></td><td class="left">Required</td><td class="left">A GOOD Emacs mode to edit Objective Caml code.</td></tr>
</tbody>
</table>


</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">Things you should know about OCaml</h2>
<div class="outline-text-2" id="text-3">

<p>I'm a newbie in OCaml, so I can't provide too much help about how to do OCaml
programming effectively in Emacs. <a href="https://realworldocaml.org/beta3/en/html/installation.html">Real World Ocaml</a> provide really detailed
instructions about how to install necessary tools to develop with
OCaml. There're also some good resources about OCaml:
</p><ul>
<li><a href="http://batteries.forge.ocamlcore.org/">http://batteries.forge.ocamlcore.org/</a>
</li>
<li><a href="http://www.camlcity.org/">http://www.camlcity.org/</a>
</li>
<li><a href="http://ocaml.org/">http://ocaml.org/</a>
</li>
<li><a href="http://search.ocaml.jp/">http://search.ocaml.jp/</a>: OCaml API search
</li>
<li><a href="http://caml.inria.fr/index.en.html">http://caml.inria.fr/index.en.html</a>: The Caml language
</li>
</ul>


</div>

</div>

<div id="outline-container-ocaml-mode" class="outline-2">
<h2 id="ocaml-mode"><a name="sec-4" id="sec-4"></a>OCaml-mode</h2>
<div class="outline-text-2" id="text-ocaml-mode">


<p>
Unlike python, there are not too many choices for OCaml in Emacs.
</p>



<pre class="example">;; Keep an empty hook function for later customization.
(defun ome-caml-mode-setup ())

(when (executable-find "ocaml")
  (ome-install 'caml-mode))
</pre>


</div>

</div>

<div id="outline-container-tuareg" class="outline-2">
<h2 id="tuareg"><a name="sec-5" id="sec-5"></a>Tuareg-mode</h2>
<div class="outline-text-2" id="text-tuareg">


<p>
You may wonder what's the relations between <code>caml-mode</code> and <code>tuareg-mode</code>? In
fact, you can use <code>tuareg-mode</code> without <code>caml-mode</code>, but some basic functions
depends on <code>caml-mode</code>, so we install both. See typerex's <a href="http://www.typerex.org/faq.html">FAQ</a> for details.
</p>



<pre class="example">(defun ome-tuareg-mode-setup ()
  ;; The following settings comes from tuareg-mode's README
  ;; use new SMIE engine
  (setq tuareg-use-smie t)
  ;; Indent `=' like a standard keyword.
  (setq tuareg-lazy-= t)
  ;; Indent [({ like standard keywords.
  (setq tuareg-lazy-paren t)
  ;; No indentation after `in' keywords.
  (setq tuareg-in-indent 0)
  ;; set ocaml library path
  (setq tuareg-library-path "/usr/lib/ocaml")
  (add-hook 'tuareg-mode-hook
            (lambda ()
              (define-key tuareg-mode-map (kbd "RET")
                'newline-and-indent))))

(when (executable-find "ocaml")
  (ome-install 'tuareg-mode))
</pre>


</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6">Todos</h2>
<div class="outline-text-2" id="text-6">

<ul>
<li>Integrate <a href="https://github.com/def-lkb/merlin">merlin</a> for auto-complete support.
</li>
<li>Define a <code>C-c C-z</code> keybinding which switch to OCaml's REPL buffer, just like
  SLIME/Geiser.
</li>
<li>More investigation on <a href="http://www.typerex.org/">Typerex</a>.
</li>
<li>Find a portable way to integrate <a href="https://github.com/diml/utop">utop</a> to Emacs.
</li>
</ul>

</div>
</div>
</div>

</body>
</html>
